package com.kurumi.enums;

public enum CostTypeEnum {

	/**
	 * 综合医疗服务类->一般医疗服务费
	 */
	C01001("C01001","一般医疗服务费"),
	/**
	 * 综合医疗服务类->一般治疗操作费
	 */
	C01002("C01002","一般治疗操作费"),
	/**
	 * 综合医疗服务类->护理费
	 */
	C01003("C01003","护理费"),
	/**
	 * 综合医疗服务类->其他费用
	 */
	C01999("C01999","其他费用"),
	/**
	 * 诊断费->病理诊断费
	 */
	C02001("C02001","病理诊断费"),
	/**
	 * 诊断费->实验室诊断费
	 */
	C02002("C02002","实验室诊断费"),
	/**
	 * 诊断费->影像学诊断费
	 */
	C02003("C02003","影像学诊断费"),
	/**
	 * 诊断费->临床诊断项目费
	 */
	C02004("C02004","临床诊断项目费"),
	/**
	 * 治疗类->非手术治疗项目费
	 */
	C03001("C03001","非手术治疗项目费"),
	/**
	 * 治疗类->临床物理治疗费
	 */
	C03002("C03002","临床物理治疗费"),
	/**
	 * 治疗类->手术治疗费
	 */
	C03003("C03003","手术治疗费"),
	/**
	 * 治疗类->麻醉费
	 */
	C03004("C03004","麻醉费"),
	/**
	 * 治疗类->手术费
	 */
	C03005("C03005","手术费"),
	/**
	 * 康复类->康复费
	 */
	C04001("C04001","康复费"),
	/**
	 * 中医类->中药治疗费
	 */
	C05001("C05001","中药治疗费"),
	/**
	 * 西药类->西药费
	 */
	C06001("C06001","西药费"),
	/**
	 * 西药类->抗菌药物费用
	 */
	C06002("C06002","抗菌药物费用"),
	/**
	 * 中药类->中成药费
	 */
	C07001("C07001","中成药费"),
	/**
	 * 中药类->中草药费
	 */
	C07002("C07002","中草药费"),
	/**
	 * 血液和血液制品类->血费
	 */
	C08001("C08001","血费"),
	/**
	 * 血液和血液制品类->白蛋白类制品费
	 */
	C08002("C08002","白蛋白类制品费"),
	/**
	 * 血液和血液制品类->球蛋白类制品费
	 */
	C08003("C08003","球蛋白类制品费"),
	/**
	 * 血液和血液制品类->凝血因子类制品费
	 */
	C08004("C08004","凝血因子类制品费"),
	/**
	 * 血液和血液制品类->细胞因子类制品费
	 */
	C08005("C08005","细胞因子类制品费"),
	/**
	 * 耗材类->检查用一次性医用材料费
	 */
	C09001("C09001","检查用一次性医用材料费"),
	/**
	 * 耗材类->治疗用一次性医用材料费
	 */
	C09002("C09002","治疗用一次性医用材料费"),
	/**
	 * 耗材类->手术用一次性医用材料费
	 */
	C09003("C09003","手术用一次性医用材料费"),
	/**
	 * 其他类->其他费
	 */
	C99999("C99999","其他费"); 
	
	// 成员变量  
    private String costTypeCode;  
    private String costTypeName;
	private CostTypeEnum(String costTypeCode, String costTypeName) {
		this.costTypeCode = costTypeCode;
		this.costTypeName = costTypeName;
	}
	public String getCostTypeCode() {
		return costTypeCode;
	}
	public String getCostTypeName() {
		return costTypeName;
	}
    
	
    
    
}
